Repository: Ideological-Atlas/backend
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: es

source: Base info
es: Información básica

source: Personal info
es: Información personal

source: Permissions
es: Permisos

source: Important dates
es: Fechas importantes

source: Send verification email
es: Enviar correo de verificación

source: Verification emails process started for selected users.
es: Se ha iniciado el proceso de envío de correos de verificación para los usuarios seleccionados.

source: Password of the user
es: Contraseña del usuario

source: Username
es: Nombre de usuario

source: Obtain Token Pair (Login)
es: Obtener par de tokens (Iniciar sesión)

source: Refresh Token
es: Refrescar token

source: Verify Token
es: Verificar token

source: Register new user
es: Registrar nuevo usuario

source: Creates a new user account, triggers verification email via Manager, and logs the user in automatically.
es: Crea una nueva cuenta de usuario, activa el correo de verificación a través del Gestor y conecta al usuario automáticamente.

source: Verify user account
es: Verificar cuenta de usuario

source: Marks a user as verified using their secret verification token.
es: Marca a un usuario como verificado usando su token de verificación secreto.

source: The verification UUID sent via email
es: El UUID de verificación enviado por correo electrónico

source: Login with Google
es: Iniciar sesión con Google

source: Validates a Google ID Token. Registers the user if they don't exist (verified automatically) and returns JWT tokens.
es: Valida un token de ID de Google. Registra al usuario si no existe (verificado automáticamente) y devuelve tokens JWT.

source: User account is disabled.
es: La cuenta de usuario está deshabilitada.

source: List all countries
es: Listar todos los países

source: List available countries from the database.
es: Listar los países disponibles en la base de datos.

source: Search by name
es: Buscar por nombre

source: List regions
es: Listar regiones

source: List regions, optionally filtered by country.
es: Listar regiones, opcionalmente filtradas por país.

source: Filter by Country ID
es: Filtrar por ID de país

source: Get or update current profile
es: Obtener o actualizar perfil actual

source: Retrieve the profile information of the currently authenticated user or update their details.
es: Recupera la información del perfil del usuario autenticado o actualiza sus detalles.

source: Set user password
es: Establecer contraseña de usuario

source: Allows an authenticated user (e.g., logged in via Google) to set a password so they can use standard login in the future.
es: Permite a un usuario autenticado (ej. conectado vía Google) establecer una contraseña para usar el inicio de sesión estándar en el futuro.

source: The Email must be set
es: Debe establecerse el correo electrónico

source: Superuser must have is_staff=True.
es: El superusuario debe tener is_staff=True.

source: Superuser must have is_superuser=True.
es: El superusuario debe tener is_superuser=True.

source: Google token has no email.
es: El token de Google no tiene correo electrónico.

source: Internal
es: Interno

source: email address
es: dirección de correo electrónico

source: Is verified
es: Está verificado

source: Field that shows if the user is verified or not.
es: Campo que muestra si el usuario está verificado o no.

source: Verification UUID
es: UUID de Verificación

source: Secret token used for email verification.
es: Token secreto utilizado para la verificación por correo electrónico.

source: Auth Provider
es: Proveedor de autenticación

source: The provider used for the user authentication/registration.
es: El proveedor utilizado para la autenticación/registro del usuario.

source: Bio
es: Biografía

source: User bio
es: Biografía del usuario

source: User
es: Usuario

source: Users
es: Usuarios

source: Association
es: Asociación

source: Associations
es: Asociaciones

source: Reference
es: Referencia

source: References
es: Referencias

source: Axis Definition
es: Definición de eje

source: Axis Definitions
es: Definiciones de eje

source: Conditioner Definition
es: Definición de condicionador

source: Conditioner Definitions
es: Definiciones de condicionador

source: General Info
es: Información general

source: Descriptions
es: Descripciones

source: System
es: Sistema

source: Associations count
es: Recuento de asociaciones

source: Condition Rule
es: Regla de condición

source: Condition Rules
es: Reglas de condición

source: Conditions
es: Condiciones

source: Standard Configuration
es: Configuración estándar

source: Only required if type is Categorical or Boolean.
es: Solo es necesario si el tipo es Categórico o Booleano.

source: Axis Logic Configuration
es: Configuración lógica del eje

source: Only required if type is 'Derived from Axis Range'. This conditioner will automatically be TRUE if the user's axis answer falls within this range.
es: Solo es necesario si el tipo es 'Derivado de rango de eje'. Este condicionador será automáticamente VERDADERO si la respuesta del eje del usuario cae dentro de este rango.

source: Usage Count
es: Recuento de uso

source: Upsert axis answer
es: Insertar/Actualizar respuesta de eje

source: Creates or updates the user's answer for a specific axis defined by UUID in URL. Allows marking answer as indifferent (null value).
es: Crea o actualiza la respuesta del usuario para un eje específico definido por UUID en la URL. Permite marcar la respuesta como indiferente (valor nulo).

source: Delete axis answer
es: Eliminar respuesta de eje

source: Deletes the user's answer for the specific axis defined by UUID in URL.
es: Elimina la respuesta del usuario para el eje específico definido por UUID en la URL.

source: List user axis answers by section
es: Listar respuestas de eje del usuario por sección

source: Returns the user's axis answers filtered by a specific ideology section.
es: Devuelve las respuestas de eje del usuario filtradas por una sección ideológica específica.

source: Get latest completed answer
es: Obtener última respuesta completada

source: Returns the latest completed answer for the authenticated user as a single object. Returns 404 if no answer exists.
es: Devuelve la última respuesta completada del usuario autenticado como un objeto único. Devuelve 404 si no existe ninguna respuesta.

source: Generate completed answer snapshot
es: Generar instantánea de respuesta completada

source: Triggers the calculation of the user's current results, saves it as a CompletedAnswer, and returns the structured data.
es: Inicia el cálculo de los resultados actuales del usuario, lo guarda como una Respuesta Completada y devuelve los datos estructurados.

source: Upsert conditioner answer
es: Insertar/Actualizar respuesta de condicionador

source: Creates or updates the user's answer for a specific conditioner defined by UUID in URL.
es: Crea o actualiza la respuesta del usuario para un condicionador específico definido por UUID en la URL.

source: Delete conditioner answer
es: Eliminar respuesta de condicionador

source: Deletes the user's answer for the specific conditioner defined by UUID in URL.
es: Elimina la respuesta del usuario para el condicionador específico definido por UUID en la URL.

source: List user conditioner answers by complexity
es: Listar respuestas de condicionador del usuario por complejidad

source: Returns the user's conditioner answers filtered by abstraction complexity (via sections or axes).
es: Devuelve las respuestas de condicionador del usuario filtradas por complejidad de abstracción (vía secciones o ejes).

source: List all abstraction complexities
es: Listar todas las complejidades de abstracción

source: Returns a list of all available complexity levels for the test.
es: Devuelve una lista de todos los niveles de complejidad disponibles para el test.

source: List axes by section
es: Listar ejes por sección

source: Returns all axes (including their conditioners) for a specific section UUID.
es: Devuelve todos los ejes (incluyendo sus condicionadores) para un UUID de sección específico.

source: List all relevant conditioners by complexity
es: Listar todos los condicionadores relevantes por complejidad

source: Returns ALL conditioners relevant for a complexity level. This includes conditioners attached to sections, axes, AND recursive dependencies (conditioners required by other conditioners).
es: Devuelve TODOS los condicionadores relevantes para un nivel de complejidad. Esto incluye condicionadores adjuntos a secciones, ejes Y dependencias recursivas (condicionadores requeridos por otros condicionadores).

source: List sections by complexity
es: Listar secciones por complejidad

source: Returns all sections associated with a specific abstraction complexity UUID.
es: Devuelve todas las secciones asociadas con un UUID de complejidad de abstracción específico.

source: List all ideologies
es: Listar todas las ideologías

source: Returns a paginated list of ideologies. Supports filtering by related entities and text search.
es: Devuelve una lista paginada de ideologías. Admite filtrado por entidades relacionadas y búsqueda de texto.

source: Search by name or descriptions
es: Buscar por nombre o descripciones

source: Filter by Country ID (Integer)
es: Filtrar por ID de país (Entero)

source: Filter by Region ID (Integer)
es: Filtrar por ID de región (Entero)

source: Filter by Religion UUID
es: Filtrar por UUID de religión

source: Filter by Tag UUID
es: Filtrar por UUID de etiqueta

source: Get ideology details
es: Obtener detalles de la ideología

source: Returns details of a specific ideology including its definition values (axis and conditioners).
es: Devuelve detalles de una ideología específica incluyendo sus valores de definición (ejes y condicionadores).

source: Axis
es: Eje

source: The specific axis being measured.
es: El eje específico que se está midiendo.

source: Is Indifferent
es: Es indiferente

source: If true, the value is irrelevant/indifferent.
es: Si es verdadero, el valor es irrelevante/indiferente.

source: Position Value
es: Valor de posición

source: Left Margin Tolerance
es: Tolerancia del margen izquierdo

source: Right Margin Tolerance
es: Tolerancia del margen derecho

source: A non-indifferent answer must have a numeric value.
es: Una respuesta no indiferente debe tener un valor numérico.

source: Conditioner
es: Condicionador

source: The question or variable being answered.
es: La pregunta o variable que se está respondiendo.

source: Answer
es: Respuesta

source: The conditioner determining visibility.
es: El condicionador que determina la visibilidad.

source: Name
es: Nombre

source: Name of this condition rule.
es: Nombre de esta regla de condición.

source: Description
es: Descripción

source: Description of the logic applied in this rule.
es: Descripción de la lógica aplicada en esta regla.

source: Trigger Values
es: Valores desencadenantes

source: List of values that satisfy this condition (e.g. ['Spain']). Must match values in the conditioner.
es: Lista de valores que satisfacen esta condición (ej. ['España']). Debe coincidir con los valores en el condicionador.

source: Must be a list of values.
es: Debe ser una lista de valores.

source: Trigger values cannot be empty.
es: Los valores desencadenantes no pueden estar vacíos.

source: Completed By
es: Completado por

source: The user who submitted this set of answers.
es: El usuario que envió este conjunto de respuestas.

source: Answers Data
es: Datos de respuestas

source: Structured JSON containing the full set of answers provided by the user.
es: JSON estructurado que contiene el conjunto completo de respuestas proporcionadas por el usuario.

source: Completed Answer
es: Respuesta completada

source: Completed Answers
es: Respuestas completadas

source: Ideology Name
es: Nombre de la ideología

source: Supporter description
es: Descripción de partidario

source: Ideology Description from the point of view of a supporter
es: Descripción de la ideología desde el punto de vista de un partidario

source: Detractor description
es: Descripción de detractor

source: Ideology Description the point of view of a detractor
es: Descripción de la ideología desde el punto de vista de un detractor

source: Neutral description
es: Descripción neutral

source: Ideology Description the point of view of a neutral
es: Descripción de la ideología desde el punto de vista neutral

source: Flag
es: Bandera

source: Ideology Flag Image
es: Imagen de la bandera de la ideología

source: Background
es: Fondo

source: Ideology Background Image
es: Imagen de fondo de la ideología

source: Ideology Color Image
es: Color de la ideología

source: Associated Countries
es: Países asociados

source: Countries where this ideology is explicitly present.
es: Países donde esta ideología está explícitamente presente.

source: Associated Regions
es: Regiones asociadas

source: Specific regions where this ideology is explicitly present.
es: Regiones específicas donde esta ideología está explícitamente presente.

source: Associated Religions
es: Religiones asociadas

source: Religions linked to this ideology.
es: Religiones vinculadas a esta ideología.

source: Tags
es: Etiquetas

source: Tags associated with this ideology.
es: Etiquetas asociadas con esta ideología.

source: Ideology
es: Ideología

source: Ideologies
es: Ideologías

source: The label for this level of abstraction (e.g., 'Concrete', 'Theoretical', 'Metaphysical').
es: La etiqueta para este nivel de abstracción (ej: 'Concreto', 'Teórico', 'Metafísico').

source: Detailed explanation of the characteristics that define this complexity level.
es: Explicación detallada de las características que definen este nivel de complejidad.

source: Complexity Score
es: Puntuación de complejidad

source: A numerical value used to rank and order the levels of abstraction (e.g., 1 for lowest, 10 for highest).
es: Un valor numérico utilizado para clasificar y ordenar los niveles de abstracción (ej: 1 para el más bajo, 10 para el más alto).

source: Ideology Abstraction Complexity
es: Complejidad de abstracción ideológica

source: Ideology Abstraction Complexities
es: Complejidades de abstracción ideológica

source: The ideology being contextualized.
es: La ideología que se está contextualizando.

source: Country
es: País

source: The country where this ideology is present or relevant.
es: El país donde esta ideología está presente o es relevante.

source: Region
es: Región

source: The specific region within a country (optional).
es: La región específica dentro de un país (opcional).

source: Religion
es: Religión

source: The religion associated with this ideology in this context.
es: La religión asociada con esta ideología en este contexto.

source: Ideology Association
es: Asociación ideológica

source: Ideology Associations
es: Asociaciones ideológicas

source: Section
es: Sección

source: The thematic section this axis belongs to.
es: La sección temática a la que pertenece este eje.

source: Internal name of the axis (e.g., 'Economic Freedom').
es: Nombre interno del eje (ej: 'Libertad económica').

source: Explanation of what this axis measures.
es: Explicación de lo que mide este eje.

source: Left Label (0%)
es: Etiqueta izquierda (0%)

source: Label for the start or minimum value of the axis (e.g., 'Total Control').
es: Etiqueta para el inicio o valor mínimo del eje (ej: 'Control total').

source: Right Label (100%)
es: Etiqueta derecha (100%)

source: Label for the end or maximum value of the axis (e.g., 'Total Liberty').
es: Etiqueta para el final o valor máximo del eje (ej: 'Libertad total').

source: Conditioners
es: Condicionadores

source: Conditioners that determine if this axis is relevant.
es: Condicionadores que determinan si este eje es relevante.

source: Ideology Axis
es: Eje ideológico

source: Ideology Axes
es: Ejes ideológicos

source: The axis being conditioned.
es: El eje que está siendo condicionado.

source: Ideology Axis Conditioner
es: Condicionador de eje ideológico

source: Ideology Axis Conditioners
es: Condicionadores de eje ideológico

source: Boolean (Yes/No)
es: Booleano (Sí/No)

source: Categorical (Selection)
es: Categórico (Selección)

source: Scale (Numeric Range)
es: Escala (Rango numérico)

source: Numeric Value
es: Valor numérico

source: Free Text
es: Texto libre

source: Derived from Axis Range
es: Derivado del rango del eje

source: The name of the conditioner or variable.
es: El nombre del condicionador o variable.

source: Detailed explanation of what this conditioner measures or defines within an ideology.
es: Explicación detallada de lo que este condicionador mide o define dentro de una ideología.

source: Type
es: Tipo

source: Defines the format of the data expected for this conditioner.
es: Define el formato de los datos esperados para este condicionador.

source: Accepted Values
es: Valores aceptados

source: List of valid options if the type is 'Categorical'. Format: ['Option A', 'Option B']. For 'Derived from Axis Range', this is auto-set to ['true', 'false'].
es: Lista de opciones válidas si el tipo es 'Categórico'. Formato: ['Opción A', 'Opción B']. Para 'Derivado de rango de eje', esto se establece automáticamente a ['true', 'false'].

source: Source Axis
es: Eje de origen

source: Only for AXIS_RANGE type. The axis to watch.
es: Solo para el tipo AXIS_RANGE. El eje a observar.

source: Min Value (Inclusive)
es: Valor mínimo (Inclusivo)

source: Condition is met if user value >= this.
es: La condición se cumple si el valor del usuario >= este.

source: Max Value (Inclusive)
es: Valor máximo (Inclusivo)

source: Condition is met if user value <= this.
es: La condición se cumple si el valor del usuario <= este.

source: Conditioners that determine the visibility of this conditioner.
es: Condicionadores que determinan la visibilidad de este condicionador.

source: Ideology Conditioner
es: Condicionador ideológico

source: Ideology Conditioners
es: Condicionadores ideológicos

source: Must be a JSON list.
es: Debe ser una lista JSON.

source: Boolean type must have accepted_values=['true', 'false']
es: El tipo booleano debe tener accepted_values=['true', 'false']

source: Categorical type must define at least one accepted value.
es: El tipo Categórico debe definir al menos un valor aceptado.

source: All values in the list must be strings.
es: Todos los valores en la lista deben ser cadenas de texto.

source: Required for Axis Range type.
es: Requerido para el tipo Rango de Eje.

source: Must specify at least min or max value for Axis Range.
es: Debe especificar al menos un valor mínimo o máximo para el Rango de Eje.

source: Target Conditioner
es: Condicionador objetivo

source: The conditioner being conditioned.
es: El condicionador que está siendo condicionado.

source: Ideology Conditioner Conditioner
es: Condicionador de condicionador ideológico

source: Ideology Conditioner Conditioners
es: Condicionadores de condicionador ideológico

source: Ideology Axis Definition
es: Definición de eje ideológico

source: Ideology Axis Definitions
es: Definiciones de eje ideológico

source: Ideology Conditioner Definition
es: Definición de condicionador ideológico

source: Ideology Conditioner Definitions
es: Definiciones de condicionador ideológico

source: The ideology supported or explained by this reference.
es: La ideología apoyada o explicada por esta referencia.

source: The title or source name (e.g., Book Title, Article Headline, Author Name).
es: El título o nombre de la fuente (ej: Título del libro, Titular del artículo, Nombre del autor).

source: Contextual details or specific quotes relevant to the ideology.
es: Detalles contextuales o citas específicas relevantes para la ideología.

source: Direct link to the source material, if available online.
es: Enlace directo al material fuente, si está disponible en línea.

source: Ideology reference
es: Referencia ideológica

source: Ideology references
es: Referencias ideológicas

source: The title of the thematic section (e.g., 'Economics', 'Social Structure').
es: El título de la sección temática (ej: 'Economía', 'Estructura social').

source: A summary of the topics and concepts covered in this section.
es: Un resumen de los temas y conceptos cubiertos en esta sección.

source: Icon
es: Icono

source: Visual representation for this section. SVG or PNG formats are recommended.
es: Representación visual para esta sección. Se recomiendan formatos SVG o PNG.

source: Abstraction Complexity
es: Complejidad de abstracción

source: The complexity level that groups these sections.
es: El nivel de complejidad que agrupa estas secciones.

source: Conditioners that determine the visibility of this section.
es: Condicionadores que determinan la visibilidad de esta sección.

source: Ideology Section
es: Sección ideológica

source: Ideology Sections
es: Secciones ideológicas

source: The section being conditioned.
es: La sección que está siendo condicionada.

source: Ideology Section Conditioner
es: Condicionador de sección ideológica

source: Ideology Section Conditioners
es: Condicionadores de sección ideológica

source: Tag
es: Etiqueta

source: The specific tag to associate with the ideology.
es: La etiqueta específica para asociar con la ideología.

source: The ideology to which this tag belongs.
es: La ideología a la que pertenece esta etiqueta.

source: Ideology tag
es: Etiqueta de ideología

source: Ideology tags
es: Etiquetas de ideología

source: Axis not found
es: Eje no encontrado

source: Conditioner not found
es: Condicionador no encontrado

source: The name of the religion or belief system.
es: El nombre de la religión o sistema de creencias.

source: Brief description of the religion's core tenets.
es: Breve descripción de los principios fundamentales de la religión.

source: Religions
es: Religiones

source: The name of the tag.
es: El nombre de la etiqueta.

source: The description of the tag.
es: La descripción de la etiqueta.

source: User Axis Answer
es: Respuesta de eje del usuario

source: User Axis Answers
es: Respuestas de eje del usuario

source: User Conditioner Answer
es: Respuesta de condicionador del usuario

source: User Conditioner Answers
es: Respuestas de condicionador del usuario

source: Here you can explore the available endpoints, authentication methods, and data structures.
es: Aquí puedes explorar los endpoints disponibles, métodos de autenticación y estructuras de datos.

source: Authentication, registration and token management.
es: Autenticación, registro y gestión de tokens.

source: User profile and verification operations.
es: Perfil de usuario y operaciones de verificación.

source: Countries and regions data.
es: Datos de países y regiones.

source: Test structure definition (axes, conditioners, etc).
es: Definición de la estructura del test (ejes, condicionadores, etc).

source: Ideologies catalog and details.
es: Catálogo y detalles de ideologías.

source: User answers and results processing.
es: Respuestas de usuarios y procesamiento de resultados.

source: Access Control
es: Control de acceso

source: Groups
es: Grupos

source: Ideological Atlas
es: Atlas Ideológico

source: Test Structure
es: Estructura del test

source: Complexities
es: Complejidades

source: Sections
es: Secciones

source: Axes
es: Ejes

source: User Data
es: Datos de usuario

source: Completed Tests
es: Tests completados

source: Axis Answers
es: Respuestas de eje

source: Conditioner Answers
es: Respuestas de condicionador

source: Monitoring & Dev
es: Monitorización y Desarrollo

source: Silk Profiler
es: Perfilador Silk

source: API Schema (Swagger)
es: Esquema de API (Swagger)

source: API Documentation (Redoc)
es: Documentación de API (Redoc)

source: Spanish
es: Español

source: English
es: Inglés

source: Control Panel
es: Panel de control
